{
    "description": "General course objectives\r\nStudents in this class will be able to apply network modelling on\r\nlocal, community, and global scale. Can apply basic text-analysis\r\nto text from e.g. social media. Has knowledge about privacy and\r\nethics, as well as challenges of applying machine learning to\r\nsocial media, within teaching, health, etc \r\nLearning objectives\r\nA student who has met the objectives of the course will be able to:\r\n\r\nExplore web APIs for data collection. Access and assess types\r\nof available on-line data for data visualization.Use state-of-the-art tools to filter, clean, and organize\r\nlarge, complex datasetsApply natural language processing to represent statistical\r\nstructures in text and analyze the content.Assess basic metrics for complex networks, and model social\r\nrelations based on network analysis.Implement software for detecting communities in social networks\r\nand analyze the communities using network metrics.Apply standard tools from high-level programming languages\r\n(e.g. Python, MatLab, R) to evaluate data visualization methods for\r\nexploration of single variable data, including dot and jitter\r\nplots, histograms, kernel density estimates, distribution\r\nfunctions, and more.Assess and apply data visualization methods for data\r\nexploration of multiple variable data, including estimating\r\nfunctional relationships (e.g. by smoothing noise, visualizing\r\nresiduals, using log, semilog-plots, and simple regressions).Use visualization techniques to evaluate and identify\r\nlimitations of summary statistics, based e.g. on Simpson’s paradox,\r\nand Anscombe’s quartet.Use basic principles of displaying visual information (e.g.\r\nTufte’s six principles of graphical integrity) to create\r\nexplanatory visualizations.Discuss key problems in applying machine learning and AI to\r\nsocial data.Content\r\nThe course is based on analyzing data from online social networks\r\n(e.g. Twitter, Wikipedia, and Reddit), as well as working with\r\nquantitative text analysis and data visualization. The course is\r\nstructured around short lectures combined with exercises, as well\r\nas a high degree of independent project work. \r\n",
    "language": "English",
    "ects": "5",
    "type": "BSc",
    "location": "Campus Lyngby",
    "evaluation": "7 step scale , internal examiner",
    "responsible": "\r\nSune Lehmann Jørgensen , Ph. (+45) 4525 3904 ,\r\nsljo@dtu.dk",
    "co-responsible": "\r\nLaura Alessandretti (Primary contact person) , Ph.\r\n(+45) 4525 3472 ,\r\nlauale@dtu.dk",
    "department": "\r\n01 Department of Applied Mathematics and Computer Science",
    "grades": {
        "-3": "0",
        "00": "0",
        "02": "0",
        "4": "0",
        "7": "6",
        "10": "11",
        "12": "6"
    },
    "reviews": [
        {
            "participants": 11,
            "timestamp": "F21",
            "1.1": {
                "question": "jeg har lært meget i dette kursus.",
                "0": "1",
                "1": "1",
                "2": "1",
                "3": "4",
                "4": "4"
            },
            "1.2": {
                "question": "undervisningsaktiviteterne på kurset stemmer godt overens med kursets læringsmål. \r\n- [Learningobjectives]",
                "0": "0",
                "1": "0",
                "2": "3",
                "3": "3",
                "4": "5"
            },
            "1.3": {
                "question": "undervisningsaktiviteterne motiverer mig til at arbejde med stoffet.",
                "0": "0",
                "1": "2",
                "2": "0",
                "3": "4",
                "4": "5"
            },
            "1.4": {
                "question": "jeg i løbet af kurset har haft mulighed for at få feedback på, hvordan jeg fagligt klarer mig på kurset.",
                "0": "1",
                "1": "0",
                "2": "0",
                "3": "4",
                "4": "6"
            },
            "1.5": {
                "question": "det generelt har været klart for mig, hvad der forventes af mig i øvelser, projektarbejde og lignende.",
                "0": "0",
                "1": "0",
                "2": "4",
                "3": "3",
                "4": "4"
            },
            "2.1": {
                "question": "5 ECTS point er normeret til 9 arbejdstimer/uge i 13-ugersperioden (45 arbejdstimer/uge i treugers-perioden). \r\nJeg mener, at den tid jeg har brugt på kurset er",
                "0": "0",
                "1": "3",
                "2": "5",
                "3": "1",
                "4": "2"
            },
            "3.1": {
                "question": "Her kan du skrive generel, konstruktiv feedback om dette kursus\r\n(Her har du mulighed for at give kommentarer om f.eks.\r\nHvad gik godt? Hvorfor?\r\nHvilke ændringer vil du foreslå som kan forbedre kurset?)"
            },
            "url": "https://evaluering.dtu.dk/kursus/02467/230735"
        }
    ],
    "name": "Computational Social Science",
    "passpercent": 95,
    "avg": 9.7,
    "pp": 91.4,
    "avgp": 78.1,
    "qualityscore": 59.1,
    "workload": 62.1,
    "lazyscore": 73.9
}